app/controllers/movies_controller.rb

    def index
      # @all_ratings = Movie.all_ratings
      # ratings_list = params[:ratings]&.keys || session[:ratings] || Movie.all_ratings
      # ratings_to_show_hash = Hash[ratings_list.collect { |item| [item, "1"] }]
      # @sort_by = params[:sort_by]
      # @movies = Movie.with_ratings(@ratings_to_show, @sort_by)

      # @all_ratings = Movie.all_ratings
      # @ratings_to_show = params[:ratings_hash]&.keys || Movie.all_ratings
      # @ratings_to_show_list = @ratings_to_show
      # @sort_by = params[:sort_by] || session[:sort_by] || 'id'

      # if params[:ratings_list]
      #   @ratings_to_show_list = params[:ratings_list]
      # elsif session[:ratings_to_show_list]
      #   @ratings_to_show_list = session[:ratings_to_show_list]
      # end

      # @movies = Movie.with_ratings(@ratings_to_show_list, @sort_by)

      # session['ratings_to_show_list'] = @ratings_to_show_list
      # session['sort_by'] = @sort_by
      @all_ratings = Movie.all_ratings
      ratings_list = params[:ratings]&.keys || session[:ratings] || Movie.all_ratings
      sort_by = params[:sort_by] || session[:sort_by] || 'id'
      @ratings_to_show_hash = Hash[ratings_list.collect { |item| [item, "1"] }]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY release_date